### Основы

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('data/StudentsPerformance.csv')

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [7]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [8]:
df.shape

(1000, 8)

In [9]:
df.groupby('gender').aggregate({'writing score' : 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [10]:
df.size

8000

In [11]:
df.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [13]:
df.iloc[[0, 3, 5, -1], [0, 7, -1]]

     gender  writing score  writing score
0    female             74             74
3      male             44             44
5    female             78             78
999  female             86             86

In [18]:
df_with_names = df.iloc[[0, 3, 4, 7, 8]]

In [21]:
df_with_names.index = ['Cersei', 'Tywin', 'Gregor', 'Joffrey', 'Ilyn Payne']
df_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [28]:
type(df_with_names.loc[['Cersei', 'Gregor'], ['race/ethnicity', 'lunch']])

pandas.core.frame.DataFrame

In [27]:
type(df_with_names.iloc[:, 0])

pandas.core.series.Series

In [37]:
series1 = pd.Series([1, 2, 3], index = ['Cersei', 'Gregor', 'Tywin'])
series2 = pd.Series([4, 5, 6, 7], index = ['Cersei', 'Gregor', 'Tywin', 'Joffrey'])

In [38]:
pd.DataFrame({'col_name1' : series1, 'col_name2' : series2})

         col_name1  col_name2
Cersei         1.0          4
Gregor         2.0          5
Joffrey        NaN          7
Tywin          3.0          6

In [41]:
df_with_names['gender'].shape

(5,)

In [42]:
df_with_names[['gender']].shape

(5, 1)

In [52]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [62]:
df = pd.read_csv('data/titanic.csv')
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Фильтрация данных

In [72]:
df = pd.read_csv('data/StudentsPerformance.csv')
df.loc[df.gender == 'female', ['gender', 'writing score']]

     gender  writing score
0    female             74
1    female             88
2    female             93
5    female             78
6    female             92
..      ...            ...
993  female             74
995  female             95
997  female             65
998  female             77
999  female             86

[518 rows x 2 columns]

In [76]:
mean_writing_score = df['writing score'].mean()

In [77]:
df.loc[df['writing score'] > mean_writing_score]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [80]:
# дурной тон задавать query, как query, нужно более подробно
query = (df['writing score'] > mean_writing_score) & (df['gender'] == 'female')
query

0       True
1       True
2       True
3      False
4      False
       ...
995     True
996    False
997    False
998     True
999     True
Length: 1000, dtype: bool

In [82]:
result = df[query]
result

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

**Задание:**

У какой доли студентов из датасэта в колонке lunch указано free/reduced?

In [93]:
df[df['lunch'] == 'free/reduced'].shape[0]/df.shape[0]

0.355

**Задание:**

Как различается среднее и дисперсия оценок по предметам у групп студентов со стандартным или урезанным ланчем?

In [118]:
df.loc[df['lunch'] == 'standard'].describe()

       math score  reading score  writing score
count  645.000000     645.000000     645.000000
mean    70.034109      71.654264      70.823256
std     13.653501      13.830602      14.339487
min     19.000000      26.000000      22.000000
25%     61.000000      63.000000      62.000000
50%     69.000000      72.000000      72.000000
75%     80.000000      82.000000      81.000000
max    100.000000     100.000000     100.000000

In [119]:
df.loc[df['lunch'] == 'free/reduced'].describe()

       math score  reading score  writing score
count  355.000000     355.000000     355.000000
mean    58.921127      64.653521      63.022535
std     15.159956      14.895339      15.433823
min      0.000000      17.000000      10.000000
25%     49.000000      56.000000      53.000000
50%     60.000000      65.000000      64.000000
75%     69.000000      75.000000      74.000000
max    100.000000     100.000000     100.000000

---

In [115]:
mean_marks_standart_lunch = df.loc[df['lunch'] == 'standard', ['math score', 'reading score', 'writing score']].mean()
dispersion_marks_standart_lunch = df.loc[df['lunch'] == 'standard', ['math score', 'reading score', 'writing score']].var()
mean_marks_reduced_lunch = df.loc[df['lunch'] == 'free/reduced', ['math score', 'reading score', 'writing score']].mean()
dispersion_marks_reduced_lunch = df.loc[df['lunch'] == 'free/reduced', ['math score', 'reading score', 'writing score']].var()
print(f'''
mean_marks_standart_lunch: 
{mean_marks_standart_lunch}

dispersion_marks_standart_lunch: 
{dispersion_marks_standart_lunch}

mean_marks_reduced_lunch: 
{mean_marks_reduced_lunch}

dispersion_marks_reduced_lunch: 
{dispersion_marks_reduced_lunch}
''')

mean_marks_standart_lunch:
math score       70.034109
reading score    71.654264
writing score    70.823256
dtype: float64

dispersion_marks_standart_lunch:
math score       186.418089
reading score    191.285560
writing score    205.620887
dtype: float64

mean_marks_reduced_lunch:
math score       58.921127
reading score    64.653521
writing score    63.022535
dtype: float64

dispersion_marks_reduced_lunch:
math score       229.824270
reading score    221.871139
writing score    238.202881
dtype: float64

In [121]:
#qf.query()
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [126]:
df = df \
    .rename(columns = 
            {'test preparation course' : 'test_preparation_course',
            'math score' : 'math_score',
            'reading score' : 'reading_score',
            'writing score' : 'writing_score'})
df.head()

,gender,race/ethnicity,parental level of education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [128]:
df.math_score

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math_score, Length: 1000, dtype: int64

In [133]:
reading_score_query = 95

In [134]:
df.query("writing_score > 75 & gender == 'female' & reading_score > @reading_score_query")

,gender,race/ethnicity,parental level of education,lunch,test_preparation_course,math_score,reading_score,writing_score
106,female,group D,master's degree,standard,none,87,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
165,female,group C,bachelor's degree,standard,completed,96,100,100
179,female,group D,some high school,standard,completed,97,100,100
373,female,group D,some college,standard,completed,82,97,96
403,female,group D,high school,standard,completed,88,99,100
458,female,group E,bachelor's degree,standard,none,100,100,100
514,female,group B,master's degree,free/reduced,completed,77,97,94
546,female,group A,some high school,standard,completed,92,100,97
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100
580,female,group D,some high school,standard,none,81,97,96
594,female,group C,bachelor's degree,standard,completed,92,100,99
685,female,group E,master's degree,standard,completed,94,99,100
712,female,group D,some college,standard,none,98,100,99
717,female,group C,associate's degree,standard,completed,96,96,99
855,female,group B,bachelor's degree,standard,none,97,97,96
886,female,group E,associate's degree,standard,completed,93,100,95
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100
957,female,group D,master's degree,standard,none,92,100,100
962,female,group E,associate's degree,standard,none,100,100,100
970,female,group D,bachelor's degree,standard,none,89,100,100
995,female,group E,master's degree,standard,completed,88,99,95

In [137]:
list(df)

['gender',
 'race/ethnicity',
 'parental level of education',
 'lunch',
 'test_preparation_course',
 'math_score',
 'reading_score',
 'writing_score']

In [138]:
score_columns = [i for i in list(df) if 'score' in i]
score_columns

['math_score', 'reading_score', 'writing_score']

In [140]:
df[score_columns].head()

   math_score  reading_score  writing_score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [141]:
df.filter(like = 'score')

     math_score  reading_score  writing_score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [144]:
df.filter(like = '2', axis = 0)

,gender,race/ethnicity,parental level of education,lunch,test_preparation_course,math_score,reading_score,writing_score
2,female,group B,master's degree,standard,none,90,95,93
12,female,group B,high school,standard,none,65,81,73
20,male,group D,high school,standard,none,66,69,63
21,female,group B,some college,free/reduced,completed,65,75,70
22,male,group D,some college,standard,none,44,54,53
...,...,...,...,...,...,...,...,...
952,female,group E,some high school,free/reduced,none,74,74,72
962,female,group E,associate's degree,standard,none,100,100,100
972,female,group A,high school,free/reduced,completed,53,50,60
982,male,group B,some high school,standard,completed,79,85,86
992,female,group D,associate's degree,free/reduced,none,55,76,76

### Группировка и агрегация